### Libraries and Dataset

In [17]:
import numpy as np
import pandas as pd

In [16]:
# Load the dataset
df = pd.read_csv("dataset/USA_CA.csv", encoding="latin1")

### Initial exploration of the dataset

#### General info

In [18]:
# Let's see what we have?
print("How many variables of each data type do we have in the dataset?")
print(
    df
    .dtypes
    .value_counts()
)
print("-"*50)
print("What are the dimesions of the dataset?")
print(df.shape)
print("-"*50)

How many variables of each data type do we have in the dataset?
object     57
int64       2
float64     1
Name: count, dtype: int64
--------------------------------------------------
What are the dimesions of the dataset?
(500, 60)
--------------------------------------------------

#### Let's take a look at the dataframe

In [19]:
# Show the first 5 rows
df.head()

,Country,Region,DataYear,ClassGrade,Gender,Ageyears,Handed,Height_cm,Footlength_cm,Armspan_cm,...,Watching_TV_Hours,Paid_Work_Hours,Work_At_Home_Hours,Schoolwork_Pressure,Planned_Education_Level,Favorite_Music,Superpower,Preferred_Status,Role_Model_Type,Charity_Donation
0,USA,CA,2012,12,Male,18.0,Left-Handed,185,27,186,...,5,0,0,NaN,Graduate degree,Rock and roll,Telepathy,Happy,Friend,"Arts, culture, sports"
1,USA,CA,2018,12,Female,17.0,Left-Handed,167,25.3,160,...,10,30,20,A lot,Graduate degree,Pop,Telepathy,Healthy,Relative,"Wildlife, animals"
2,USA,CA,2019,12,Female,17.0,Right-Handed,166,24,167,...,0,30,2,A lot,Undergraduate degree,Other,Fly,Happy,Other,International aid
3,USA,CA,2013,12,Female,17.0,Right-Handed,162.5,23.36,167.6,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,USA,CA,2014,12,Male,17.0,Right-Handed,188,NaN,NaN,...,4,1,3,Some,Graduate degree,Rock and roll,Freeze time,Happy,Sports person,Health

In [13]:
# Show the last 5 rows
df.tail()

,Country,Region,DataYear,ClassGrade,Gender,Ageyears,Handed,Height_cm,Footlength_cm,Armspan_cm,...,Watching_TV_Hours,Paid_Work_Hours,Work_At_Home_Hours,Schoolwork_Pressure,Planned_Education_Level,Favorite_Music,Superpower,Preferred_Status,Role_Model_Type,Charity_Donation
495,USA,CA,2011,12,Male,17.0,Right-Handed,187.9,33.0,195.7,...,15,7,4,NaN,NaN,NaN,NaN,NaN,NaN,NaN
496,USA,CA,2018,12,Male,17.0,Right-Handed,175.2,26.6,167.6,...,5,15,10,Some,Undergraduate degree,Rap/Hip hop,Fly,Rich,Other,Environment
497,USA,CA,2021,12,Female,17.0,Right-Handed,165,23,160,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
498,USA,CA,2019,12,Female,17.0,Right-Handed,162,25.7,164,...,15,0,4,Some,Graduate degree,Other,Telepathy,Happy,Relative,Education/Youth development
499,USA,CA,2018,12,Male,17.0,Right-Handed,180,25,180,...,2,12,2,Very little,Graduate degree,Pop,Super strength,Famous,Musician or singer,Environment

In [14]:
# How is each variable?
df.describe()

          DataYear  ClassGrade    Ageyears
count   500.000000  500.000000  497.000000
mean   2017.904000   10.716000   15.991952
std       3.438376    2.115726    3.417804
min    2010.000000    4.000000    8.000000
25%    2016.000000   10.000000   15.000000
50%    2018.000000   12.000000   17.000000
75%    2021.000000   12.000000   17.000000
max    2024.000000   12.000000   75.000000

#### List of to do's

In [15]:
# Is cleaning necessary?
# Are there duplicate data?